code-review/Экзамен/ОУ_ПартионныйУчет/config/InformationRegisters/УчетнаяПолитикаУУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаУУ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодОценкиЗапасов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОценкиЗапасов</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/Экзамен/ОУ_ПартионныйУчет/config/Enums/МетодыОценкиЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МетодыОценкиЗапасов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FIFO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LIFO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/Экзамен/ОУ_ПартионныйУчет/config/CommonModules/УчетнаяПолитикаСервер/Ext/Module.bsl
// Описание: Возвращает метод оценки запасов по учетной политике на указанную дату.
// Если запись на дату не найдена, используется FIFO.
//
// Параметры:
// ДатаДокумента - Дата - дата, на которую нужно получить метод оценки
//
// Возвращаемое значение:
// ПеречислениеСсылка.МетодыОценкиЗапасов - метод оценки запасов
//
// Пример:
// Метод = УчетнаяПолитикаСервер.МетодОценкиНаДату(Дата(2026, 1, 15));
//
Функция МетодОценкиНаДату(ДатаДокумента) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетнаяПолитикаУУ.МетодОценкиЗапасов КАК МетодОценкиЗапасов
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаУУ.СрезПоследних(&ДатаДокумента, ) КАК УчетнаяПолитикаУУ";
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Перечисления.МетодыОценкиЗапасов.FIFO;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.МетодОценкиЗапасов;

КонецФункции
